stko/oobd/interface/D2/Firmware_FreeRTOS/Demo/CORTEX_STM32F103E_Eclipse_GCC/src/SystemConfig.c
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

  /** --------------------------------------------------------------------------
    * PB 0 = ADC12_IN8 = GPIO_Mode_AIN - Input floating for low power consumption
    * PB 1 = ??? = GPIO_Mode_AIN - Input floating for low power consumption
    * PB 2 = ??? = GPIO_Mode_AIN - Input floating for low power consumption
    * PB 3 = ??? = GPIO_Mode_AIN - Input floating for low power consumption
    * PB 4 = DXM1 IO Pin 13, LED2 - red = GPIO_Mode_Out_OD - Output open drain
    * PB 5 = DXM1 IO Pin 12, LED1 - green = GPIO_Mode_Out_OD - Output open drain
    * PB 6 = 24LC16, SCL = GPIO_Mode_AF_OD = Alternate Function output open drain
    * PB 7 = 24LC16, SDA = GPIO_Mode_AF_OD = Alternate Function output open drain
    * --------------------------------------------------------------------------
    * PB 8 = TJA1050 Pin 4 (RxD)  = GPIO_Mode_IPU - Input Pullup
    * PB 9 = TJA1050 Pin 1 (TxD)  = GPIO_Mode_AF_PP - Alternate Function output Push Pull
    * PB10 = DXM1 IO Pin 15, LCD out  = GPIO_Mode_AIN - currently unused
    * PB11 = DXM1 IO Pin 18, A0 out   = GPIO_Mode_AIN - currently unused
    * PB12 = DXM1 IO Pin 19, SPI_CS   = GPIO_Mode_AIN - currently unused
    * PB13 = DXM1 IO Pin 20, SPI_SCK  = GPIO_Mode_AIN - currently unused
    * PB14 = DXM1 IO Pin 22, SPI_MISO = GPIO_Mode_AIN - currently unused
    * PB15 = DXM1 IO Pin 23, SPI_MOSI = GPIO_Mode_AIN - currently unused
    *---------------------------------------------------------------------------
    */
//! @todo Analog input must be integrated to get the current power supply Vbat
  /* configure analog input PB0 = ADC12_IN8 */
/*
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_0;
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AIN;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
*/
  /* configure Output (open drain) of LED1 - green (PB5) and LED2 - red (PB4) */
  GPIO_PinRemapConfig(GPIO_Remap_SWJ_NoJTRST, ENABLE); /* release alternative GPIO function of PB4 */
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_4 | GPIO_Pin_5;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_OD;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  /* start CAN configuration */
  /* GPIO clock enable */
  GPIO_PinRemapConfig(GPIO_Remap1_CAN1, ENABLE);
  /* Configure CAN pin: RX */
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_8;
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  /* Configure CAN pin: TX */
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_9;
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  /* CAN1 Periph clock enable */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN1, ENABLE);

  /* Configure I2C pins: SCL and SDA ----------------------------------------*/
//  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_6 | GPIO_Pin_7;
//  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_OD;
//  GPIO_Init(GPIOB, &GPIO_InitStructure);

  /** --------------------------------------------------------------------------
    * PC13 = ??? = GPIO_Mode_AIN - Input floating for low power consumption
    * PC14 = DXM1 IO Pin 29 = GPIO_Mode_IPU - Input with Pullup
    * PC15 = DXM1 IO Pin 28 = GPIO_Mode_IPU - Input with Pullup
    * --------------------------------------------------------------------------
    */

  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_14 | GPIO_Pin_15;
  /* initialize new PortC settings  */
  GPIO_Init(GPIOC, &GPIO_InitStructure);
}
/*----------------------------------------------------------------------------*/

/**
  * @brief  Configures the different GPIO ports
  * @param  None
  * @retval None
  */
void USART1_Configuration(void)
{
  volatile unsigned long nCount, nLength = 300000;
  USART_InitTypeDef USART_InitStructure;
  uint8_t BTM222_UartAutobaudControl;

  USART_DeInit(USART1); /* Reset Uart to default */

  /** USARTx configuration -----------------------------------------------------
    * USARTx configured as follow:
    *      - BaudRate = 115200 baud
    *      - Word Length = 8 Bits
    *      - One Stop Bit
    *      - None parity
    *      - Hardware flow control disabled (RTS and CTS signals)
    *      - Receive and transmit enabled
    */
  USART_InitStructure.USART_BaudRate            = USART1_BAUDRATE_DEFAULT;
  USART_InitStructure.USART_WordLength          = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits            = USART_StopBits_1;
  USART_InitStructure.USART_Parity              = USART_Parity_No;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode                = USART_Mode_Rx | USART_Mode_Tx;

  /* Configure USART1 */
  USART_Init(USART1, &USART_InitStructure);

  /* Enable the USART1 */
  USART_Cmd(USART1, ENABLE);

  /* Enable the USART1-Transmit interrupt: this interrupt is generated when the
     USART1 transmit data register is empty */
  /* USART_ITConfig(USART1, USART_IT_TXE, ENABLE); */

  /* Enable the USART1-Receive interrupt: this interrupt is generated when the
     USART1 receive data register is not empty */
  USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
  NVIC_Configuration ();

  /* set UartAutobaudControl to default UART value 115200kbit/s */
  BTM222_UartAutobaudControl = 0;

  while (BTM222_UartAutobaudControl != 9)
  {

	BTM222_UART_Rx_Flag = pdFALSE;
	BufCnt = 0;
	USART_SendData(USART1, 'a');
	for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
	USART_SendData(USART1, 't');
	for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
	USART_SendData(USART1, '\r');
	for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
	for( nCount = 0; nCount < 100000; nCount++ ) { }; /* delay */

	BufCnt = 0;
	USART_SendData(USART1, 'a');
	for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
	USART_SendData(USART1, 't');
	for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
	USART_SendData(USART1, 'l');
	for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
	USART_SendData(USART1, '?');
	for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
	USART_SendData(USART1, '\r');
	for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
	for( nCount = 0; nCount < 800000; nCount++ ) { }; /* delay */

	/* check received response character from BTM222 */
	switch (BTM222_UartSpeed)
	{
	  case '1':
        DEBUGUARTPRINT("\r\n*** BTM222 - L1 = 9600bps detected! ***");
        USART_SendData(USART1, 'a');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, 't');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, 'l');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, '5');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, '\r');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        BTM222_UartAutobaudControl = 6;
        break;

      case '2':
        DEBUGUARTPRINT("\r\n*** BTM222 - L2 = 19200bps detected! ***");
        USART_SendData(USART1, 'a');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, 't');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, 'l');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, '5');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, '\r');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        BTM222_UartAutobaudControl = 6;
        break;

