stko/oobd/interface/D2/Firmware_FreeRTOS/Demo/CORTEX_STM32F103E_Eclipse_GCC/src/SystemConfig.c
      case '3':
        DEBUGUARTPRINT("\r\n*** BTM222 - L3 = 38400bps detected! ***");
        BTM222_UART_Rx_Flag = pdFALSE;
        USART_SendData(USART1, 'a');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, 't');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, 'l');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, '5');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, '\r');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        BTM222_UartAutobaudControl = 6;
        BTM222_UART_Rx_Flag = pdTRUE;
        break;

      case '4':
        DEBUGUARTPRINT("\r\n*** BTM222 - L4 = 57600bps detected! ***");
        USART_SendData(USART1, 'a');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, 't');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, 'l');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, '5');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, '\r');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        BTM222_UartAutobaudControl = 6;
        break;

      case '5':
        DEBUGUARTPRINT("\r\n*** BTM222 - L5 = 115200bps detected! ***");
        BTM222_UartAutobaudControl = 9;
        break;

      case '6':
        DEBUGUARTPRINT("\r\n*** BTM222 - L6 = 230400bps detected! ***");
        USART_SendData(USART1, 'a');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, 't');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, 'l');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, '5');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, '\r');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        BTM222_UartAutobaudControl = 6;
        break;

      case '7':
        DEBUGUARTPRINT("\r\n*** BTM222 - L7 = 460800bps detected! ***");
        USART_SendData(USART1, 'a');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, 't');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, 'l');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, '5');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        USART_SendData(USART1, '\r');
        for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
        BTM222_UartAutobaudControl = 6;
        break;

      default:
        DEBUGUARTPRINT("\r\n*** BTM222 - baudrate not detected! ***");
        BTM222_UartAutobaudControl++; /* increment AutobaudControl counter */
        break;
    }

    switch (BTM222_UartAutobaudControl)
    {
      case 1:
        /* Initialize USART1 with next possible baudrate of BTM222 */
        USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_4800;
        break;

      case 2:
        /* Initialize USART1 with next possible baudrate of BTM222 */
        USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_9600;
        break;

      case 3:
        /* Initialize USART1 with next possible baudrate of BTM222 */
        USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_19200;
        break;

      case 4:
        /* Initialize USART1 with next possible baudrate of BTM222 */
        USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_38400;
        break;

      case 5:
        /* Initialize USART1 with next possible baudrate of BTM222 */
        USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_57600;
        break;

      case 6:
        /* Initialize USART1 with next possible baudrate of BTM222 */
        USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_115200;
        break;

      case 7:
        /* Initialize USART1 with next possible baudrate of BTM222 */
        USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_230400;
        break;

      case 8:
        /* Initialize USART1 with next possible baudrate of BTM222 */
        USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_460800;
        break;

      case 9:
        /* fallback to default baudrate */
        USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_DEFAULT;
        break;

      default:
        break;
    }
    USART_Init(USART1, &USART_InitStructure); /* reinitialization of USART */

  } /* end of for */
  DEBUGUARTPRINT("\r\n*** Autobaud SCAN for BTM222 finished! ***");

  /* get Bluetooth address of BTM222 before going on */
  /* send request to BTM222 => Bluetooth-Serial must be disconnected at this state*/
  /* disable local echo of BTM222 */
  //  USART_SendData(USART1, 'a');
  //  for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
  //  USART_SendData(USART1, 't');
  //  for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
  //  USART_SendData(USART1, 'e');
  //  for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
  //  USART_SendData(USART1, '1');
  //  for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */
  //  USART_SendData(USART1, '\r');
  //  for( nCount = 0; nCount < nLength; nCount++ ) { }; /* delay */

  DEBUGUARTPRINT("\r\n*** Starting to get BTM222 BT address! ***");
  /*  set default BTM222_BtAddress = 00:00:00:00:00:00 */
  for (BufCnt = 0; BufCnt <=18; BufCnt ++) {
	if ( BufCnt == 2 || BufCnt == 5 || BufCnt == 8 || BufCnt == 11 || BufCnt == 14)
  	  BTM222_BtAddress[BufCnt] = ':';
  	else if (BufCnt == 17)
  	  BTM222_BtAddress[BufCnt] = '\0'; /* add string termination */
  	else
  	  BTM222_BtAddress[BufCnt] = '0';  /* initial default value 0 */
  }

